{
  "_name_or_path": "nvidia/mit-b3",
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 768,
  "depths": [
    3,
    4,
    18,
    3
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    64,
    128,
    320,
    512
  ],
  "id2label": {
    "0": "_background_",
    "1": "back_bumper",
    "2": "back_glass",
    "3": "back_left_door",
    "4": "back_left_light",
    "5": "back_right_door",
    "6": "back_right_light",
    "7": "front_bumper",
    "8": "front_glass",
    "9": "front_left_door",
    "10": "front_left_light",
    "11": "front_right_door",
    "12": "front_right_light",
    "13": "hood",
    "14": "left_mirror",
    "15": "right_mirror",
    "16": "tailgate",
    "17": "trunk",
    "18": "wheel"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "_background_": 0,
    "back_bumper": 1,
    "back_glass": 2,
    "back_left_door": 3,
    "back_left_light": 4,
    "back_right_door": 5,
    "back_right_light": 6,
    "front_bumper": 7,
    "front_glass": 8,
    "front_left_door": 9,
    "front_left_light": 10,
    "front_right_door": 11,
    "front_right_light": 12,
    "hood": 13,
    "left_mirror": 14,
    "right_mirror": 15,
    "tailgate": 16,
    "trunk": 17,
    "wheel": 18
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.21.1"
}
